import { FC } from 'react';
import { useTranslations } from 'next-intl';
import { IArticle } from '@/models/Article';
import Breadcrumbs from '@/components/layouts/Breadcrumbs';
import MainIcon from '@/components/icons/MainIcon';
import BlogIcon from '@/components/icons/BlogIcon';
import ArticleIcon from '@/components/icons/ArticleIcon';

interface IProps {
    data: IArticle;
}

const Body: FC<IProps> = ({ data }) => {
    const allPagesT = useTranslations('all-pages');

    const breadcrumbsPages = [
        {
            href: 'main',
            icon: (
                <MainIcon classes="w-3.5 h-3.5 fill-zinc-500 dark:fill-zinc-400 group-hover:dark:fill-zinc-600" />
            ),
            name: allPagesT('main'),
        },
        {
            href: 'blog',
            icon: (
                <BlogIcon classes="w-4 h-4 fill-zinc-200 dark:fill-zinc-400" />
            ),
            name: allPagesT('blog'),
        },
        {
            href: `blog/${data.slug}`,
            icon: (
                <ArticleIcon classes="w-4 h-4 fill-zinc-200 dark:fill-zinc-400" />
            ),
            name: data.title,
        },
    ];

    return (
        <div className="mx-auto mt-3 w-full max-w-7xl">
            <Breadcrumbs
                seoPages={breadcrumbsPages}
                visualPages={breadcrumbsPages}
            />

            <div className="mt-6 flex flex-col gap-5 px-4 pb-6 desktop-sm:px-0 desktop-sm:pb-10">
                <h1 className="text-4xl font-bold text-zinc-700 dark:text-zinc-300">
                    {data.title}
                </h1>

                {/*<div dangerouslySetInnerHTML={{ __html: data.content }} />*/}

                <main className="flex flex-col gap-5">
                    {/*111111111111111*/}
                    <section className="flex flex-col gap-5 tablet-lg:flex-row">
                        <div className="flex flex-col gap-2 tablet-lg:w-2/3">
                            <h2 className="text-xl font-bold text-zinc-700 dark:text-zinc-300 desktop-xs:text-2xl">
                                Роль бажань та можливості їх виконання
                            </h2>

                            <p className="text-zinc-700 dark:text-zinc-300 desktop-xs:text-lg">
                                У тебе є бажання? Упевнений, що є. Чи всі твої
                                бажання виконуються? Напевно, ні. Як підвищити
                                частоту виконання бажань? Чи всі бажання
                                виконуються в інших людей? І як вони взагалі
                                виконуються?
                            </p>

                            <p className="text-zinc-700 dark:text-zinc-300 desktop-xs:text-lg">
                                Напевно, у багатих бажання виконуються частіше,
                                ніж у бідних. Думаєш це безпосередньо залежить
                                від наявності грошей? Ну звісно! Якщо є купа
                                грошей і ти хочеш, наприклад, машину, тоді йди в
                                салон і купуй. Тут якраз усе зрозуміло. А якщо
                                ти фінансово обділений, то ні про яку машину й
                                мови бути не може. У бідняка інший світ і
                                цінності. Йому доводиться вибирати, купити собі
                                ковбаси чи купити мівіни та заощадити.
                            </p>
                        </div>

                        <img
                            className="tablet-lg:w-1/3"
                            src="https://s3.eu-central-1.amazonaws.com/wish.hub/blog/wishes/1.webp"
                            alt="багатий та бідний"
                        />
                    </section>

                    {/*2222222222222*/}
                    <section className="flex flex-col gap-5 tablet-lg:flex-row-reverse">
                        <div className="flex flex-col gap-2 tablet-lg:w-2/3">
                            <h2 className="text-xl font-bold text-zinc-700 dark:text-zinc-300 desktop-xs:text-2xl">
                                Матеріальні та нематеріальні бажання
                            </h2>

                            <p className="text-zinc-700 dark:text-zinc-300 desktop-xs:text-lg">
                                А як щодо нематеріальних бажань? Їх за гроші не
                                купиш. Наприклад, ти хочеш кохання. Або бути
                                здоровим. А може тобі б хотілося спортивне,
                                підтягнуте тіло. Ти можеш заперечити, що і це
                                можна купити за гроші. Це, звісно, так. Але
                                продажне кохання ніколи не буде щирим. Платні
                                клініки не дуже то зацікавлені у твоєму
                                здоров'ї. А над своїм тілом потрібно працювати,
                                і гроші в цьому питанні відіграють далеко не
                                першу роль.
                            </p>
                        </div>

                        <img
                            className="tablet-lg:w-1/3"
                            src="https://s3.eu-central-1.amazonaws.com/wish.hub/blog/wishes/2.webp"
                            alt="багатий та бідний"
                        />
                    </section>

                    {/*33333333333333333*/}
                    <section className="flex flex-col gap-2">
                        <h2 className="text-xl font-bold text-zinc-700 dark:text-zinc-300 desktop-xs:text-2xl">
                            Вплив думок на виконання бажань
                        </h2>

                        <p className="text-zinc-700 dark:text-zinc-300 desktop-xs:text-lg">
                            Мені здається, що в багатих бажання виконуються
                            частіше не через те, що в них є гроші. А навпаки, у
                            них є гроші через те, що бажання цих людей
                            виконуються частіше.
                        </p>

                        <p className="text-zinc-700 dark:text-zinc-300 desktop-xs:text-lg">
                            Напевно, ні для кого не секрет, що головною рушійною
                            силою виконання бажань є думки. Твердження "думка
                            матеріальна" не нове.
                        </p>

                        <p className="text-zinc-700 dark:text-zinc-300 desktop-xs:text-lg">
                            А які ще чинники впливають на виконання наших
                            бажань?
                        </p>
                    </section>

                    {/*44444444444444*/}
                    <section className="flex flex-col gap-2">
                        <h2 className="text-xl font-bold text-zinc-700 dark:text-zinc-300 desktop-xs:text-2xl">
                            Знайти свій шлях і свої бажання
                        </h2>

                        <p className="text-zinc-700 dark:text-zinc-300 desktop-xs:text-lg">
                            Зараз дуже активно нам натякають, що потрібно шукати
                            свій шлях, своє призначення, свою стезю. Натякають
                            звідусіль. Ці натяки важко пропустити чи ігнорувати.
                            Знайти свою дорогу в житті буває не просто. Багато
                            хто шукає її роками. Зі свого досвіду скажу що воно
                            того варте.
                        </p>

                        <p className="text-zinc-700 dark:text-zinc-300 desktop-xs:text-lg">
                            А що з бажаннями? Бажання, так само бувають свої, а
                            бувають нав'язані із зовні. "Я ненавиджу водити, але
                            мені потрібна машина, щоб добиратися до роботи. Я
                            ненавиджу свою роботу, але мені потрібно виплачувати
                            кредит за машину." Свої бажання виконуються легко і
                            невимушено. Нав'язані ж будуть енергетично тягнути
                            тебе вниз, постійно ваблячи до себе красивою
                            обгорткою, вони будуть вимотувати. Свої ж навпаки
                            наповнювати енергією. Своє бажання чи чуже, напевно,
                            другий за вагомістю фактор у питанні матеріалізації
                            думок, але не менш важливий.
                        </p>
                    </section>

                    {/*5555555555555555*/}
                    <section className="flex flex-col gap-2">
                        <h2 className="text-xl font-bold text-zinc-700 dark:text-zinc-300 desktop-xs:text-2xl">
                            Енергетична вага бажань та сила думок
                        </h2>

                        <p className="text-zinc-700 dark:text-zinc-300 desktop-xs:text-lg">
                            І що виходить? У бажання є енергетична вага. А у
                            тебе є енергетична сила у вигляді думок, щоб цю вагу
                            підняти. Це дуже абстрактне уявлення, але на моє
                            особисте переконання не позбавлене сенсу.
                        </p>

                        <p className="text-zinc-700 dark:text-zinc-300 desktop-xs:text-lg">
                            Копнімо глибше і розберемося докладніше. Зі своїми
                            бажаннями все просто. Вони завжди виконуються, тому
                            що сила цих бажань дорівнює силі твоїх думок. Іншими
                            словами, твої бажання збігаються з твоїми
                            можливостями. І стороння допомога тут не потрібна.
                        </p>

                        <p className="text-zinc-700 dark:text-zinc-300 desktop-xs:text-lg">
                            А що ж робити з бажаннями, які не твої. Вони то не
                            перестають хотітися. Іноді хочеться так що аж
                            свербить. Тут усе набагато складніше. Якщо твоє
                            нинішнє становище кардинально різниться з твоїми
                            запитами, то мені тебе щиро шкода. Уяви собі
                            безхатька біля смітника, який хоче жити в замку.
                            Набагато простіше перестати хотіти, ніж мріяти та
                            сподіватися даремно. Це найменш затратно в
                            енергетичному плані. Ну а якщо твоє бажання все ж
                            таки наближене до реальності, але все одно не по
                            кишені. А хочеться дуже сильно. Що тоді? Тоді
                            очевидно, що тобі потрібна допомога, у вигляді
                            додаткової енергії. Груба сила тут не допоможе.
                            Допоможе, звісно, якщо ти не боїшся наслідків)) А де
                            цю енергію взяти?
                        </p>
                    </section>

                    {/*666666666666*/}
                    <section className="flex flex-col gap-2">
                        <h2 className="text-xl font-bold text-zinc-700 dark:text-zinc-300 desktop-xs:text-2xl">
                            Джерела енергії у навколишньому світі
                        </h2>

                        <p className="text-zinc-700 dark:text-zinc-300 desktop-xs:text-lg">
                            Дуже багато речей у цьому світі мають енергію...
                            Навіть не так. Абсолютно всі речі в матеріальному
                            світі мають енергію. У кожної речі вона різна.
                            Візьмемо твій пристрій, з якого ти читаєш цей текст.
                            Тільки уяви скільки компаній взяло участь у
                            створенні цього дива техніки. І в кожній компанії
                            працює не одна сотня співробітників. Тож твій
                            комп'ютер, ноутбук або смартфон зібрав у собі
                            енергію всіх людей, які були причетні до його
                            створення. Додай сюди енергію програмістів, які
                            віддали її частинку для того, щоб ця машина
                            працювала. І це навіть не матеріальна складова твого
                            гаджета. Навіть яблуко, яке ти купив у бабусі з рук
                            має в собі її енергію. Яку вона витратила, щоб
                            зірвати його, привезти на базар і продати тобі. Не
                            кажучи вже про яблука з супермаркету. І є ще одне в
                            цьому світі, яке має обчислювану енергію. Це гроші.
                        </p>
                    </section>

                    {/*77777777777777777*/}
                    <section className="flex flex-col gap-2">
                        <h2 className="text-xl font-bold text-zinc-700 dark:text-zinc-300 desktop-xs:text-2xl">
                            Енергія грошей і виконання бажань
                        </h2>

                        <p className="text-zinc-700 dark:text-zinc-300 desktop-xs:text-lg">
                            Так. Це найенергетичніша матеріальна, а сьогодні вже
                            й електронна штука. Це легко довести. Заплющ очі. І
                            чітко уяви собі зараз, що начальник підвищив тобі
                            зарплату на 20%. Які відчуття? А уяви, що ти знайшов
                            лотерейний білет і виграв 100 000 доларів. Відчуваєш
                            різницю? Це доводить, по-перше, що гроші мають
                            енергію, а по-друге, що їхня кількість прямо
                            пропорційна енергії, яка в них міститься. За великим
                            рахунком практично всі твої бажання торкнуться
                            грошового питання в тому чи іншому плані. Любляча
                            дружина, звісно, буде тебе любити і в бідності, і в
                            багатстві, але відчуття в розкішному будинку будуть
                            яскравішими, ніж в однушці зі старими шпалерами.
                            Здоров'я за гроші, звісно, не купиш, але навіть
                            елементарні переломи оперуються не безплатно. І в
                            хорошому тренажерному залі з кваліфікованим тренером
                            приводити своє тіло до ладу набагато приємніше, ніж
                            на турніках у дворі. Так і виходить, що нібито гроші
                            не головне, але з ними набагато приємніше і легше.
                        </p>
                    </section>

                    {/*888888888888888888888*/}
                    <section className="flex flex-col gap-2">
                        <h2 className="text-xl font-bold text-zinc-700 dark:text-zinc-300 desktop-xs:text-2xl">
                            Сила вдячності та енергія подарунків
                        </h2>

                        <p className="text-zinc-700 dark:text-zinc-300 desktop-xs:text-lg">
                            Ну і нарешті найголовніше. Як нам пов'язати гроші та
                            бажання на які в нас не вистачає енергії. Коли тобі
                            дарують щось безоплатно, які у тебе виникають
                            почуття? Глибокої вдячності. І тобі хотілося б цій
                            людині якось віддячити. Подумки ти починаєш бажати
                            їй усього найкращого. Правильно? Так ось в інших
                            людей абсолютно ті самі відчуття за аналогічних
                            ситуацій. І ці пориви набагато сильніші, якщо
                            подарунок несподіваний і що найголовніше цінний.
                            Відповідні побажання можуть бути
                            найрізноманітнішими. В основному це те, що ми самі
                            для себе цінуємо найбільше. А якщо людина, яка нам
                            робить подарунок, збирає на будинок і ми про це
                            знаємо. Найперший порив побажати їй скоріше купити
                            цей будинок. "Я бажаю тобі нарешті купити будинок
                            своєї мрії!!! Такий, як ти хочеш!!!" Знайома
                            ситуація?
                        </p>

                        <p className="text-zinc-700 dark:text-zinc-300 desktop-xs:text-lg">
                            Адже ти знаєш, що багаті люди постійно жертвують
                            частину своїх статків на благодійність. Подумай, як
                            це відбувається. Мені здається, багата людина
                            захоче, щоб про її пожертвування, наприклад, у
                            дитячий будинок дізналося якомога більше людей. Які
                            думки будуть у людей, які знають про пожертвування?
                            Які думки будуть у персоналу цього дитячого будинку?
                            А у дітей, які вже можуть усвідомити ситуацію?
                            Природно найприємніші! "Нехай Ваш бізнес зростає і
                            процвітає!!! Щоб успіх постійно переслідував Вас!!!
                            І справи йшли якнайкраще!!!"
                        </p>
                    </section>

                    {/*99999999999999999*/}
                    <section className="flex flex-col gap-2">
                        <h2 className="text-xl font-bold text-zinc-700 dark:text-zinc-300 desktop-xs:text-2xl">
                            Wish Hub: платформа для здійснення бажань
                        </h2>

                        <p className="text-zinc-700 dark:text-zinc-300 desktop-xs:text-lg">
                            Це веб-приложення створене для того, щоб твої
                            бажання стали реальністю. Тут кожне бажання має свій
                            "енергетичний" грошовий еквівалент — це сума, яку
                            визначає той, хто мріє. Якщо ти хочеш допомогти
                            іншій людині, найкраще, що можна зробити, — це
                            здійснити її мрію, обравши відповідний подарунок,
                            якщо твої можливості дозволяють це зробити. А коли
                            мова йде про твої бажання, їхня реалізація стає
                            більш ймовірною, якщо ти їх запишеш і поділишся з
                            іншими. Адже колективна енергія підтримки та добрих
                            думок значно збільшує шанси на втілення будь-якої
                            мрії. Залиш свої бажання тут, і нехай енергія добра
                            та взаємодопомоги працює на їхнє здійснення!
                        </p>
                    </section>
                </main>
            </div>
        </div>
    );
};

export default Body;
